// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

Console.WriteLine("Введите первое число ");
int a = int.Parse(Console.ReadLine());
Console.WriteLine("Введите второе число ");
int b = int.Parse(Console.ReadLine());
Console.WriteLine("Введите третье число ");
int c = int.Parse(Console.ReadLine());
if (a > b) 
{
    if (a > c)
        Console.WriteLine("max = " + a);
    else 
        Console.WriteLine("max = " + c);
}
else
Console.WriteLine("max = " + b);